src/Catalogs/scmВнешниеСервисы_ПараметрыСоединения/scmВнешниеСервисы_ПараметрыСоединения.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>scmВнешниеСервисы_ПараметрыСоединения</name>
  <predefined>
    <items>
      <name>bot_01</name>
      <description>Bot 01</description>
    </items>
  </predefined>
  <attributes>
    <name>Активно</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ЭтоБот</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>АдресРесурса</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>128</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ХостСервера</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>128</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПортСервера</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Пароль</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>64</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЗащищенноеСоединение</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>АктивныеЧаты</name>
    <attributes>
      <name>Активен</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>Чат</name>
      <comment>Обрабатывать ответы чата</comment>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>12</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Имя</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

src/CommonModules/scmОбщегоНазначенияПовтИсп/Module.bsl
Функция СписокПараметровСоединения() Экспорт 
	
	ММ = Новый Массив();
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ПП.Наименование КАК ИмяСервиса
		|ИЗ
		|	Справочник.scmВнешниеСервисы_ПараметрыСоединения КАК ПП";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
			ММ.Добавить(ВыборкаДетальныеЗаписи["ИмяСервиса"]);		
	КонецЦикла;
	
	Возврат ММ;
	
КонецФункции

Функция ПараметрыСоединения(ИмяСервиса) Экспорт 
	
	СС = Новый Структура("АдресРесурса, АдресРесурса, ХостСервера, ПортСервера, Пароль, ЗащищенноеСоединение");
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ПП.Наименование КАК ИмяСервиса,
		|	ПП.АдресРесурса КАК АдресРесурса,
		|	ПП.ХостСервера КАК ХостСервера,
		|	ПП.ПортСервера КАК ПортСервера,
		|	ПП.Пароль КАК Пароль,
		|	ПП.ЗащищенноеСоединение КАК ЗащищенноеСоединение
		|ИЗ
		|	Справочник.scmВнешниеСервисы_ПараметрыСоединения КАК ПП";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		ЗаполнитьЗначенияСвойств(СС, ВыборкаДетальныеЗаписи); 		
	КонецЦикла;
	
	Возврат СС;
	
КонецФункции
